      * ----------------------------------------------------------------
      * Project: {project_name}
      * Member : {member_name}
      * Desc   : {description}
      * Author : {author_name}
      * Date   : {creation_date}
      * ----------------------------------------------------------------
      *
      * ----------------------------------------------------------------
      * Display File Definition
      * ----------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A                                      PRINT
     A                                      ERRSFL
      *
      * ----------------------------------------------------------------
      * Record Format: Main Screen
      * ----------------------------------------------------------------
     A          R {screen_format}
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                      OVERLAY
      *
      * ----------------------------------------------------------------
      * Screen Title and Header
      * ----------------------------------------------------------------
     A                                  1  2'{screen_title}'
     A                                      DSPATR(HI)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                  2 70TIME
      *
      * ----------------------------------------------------------------
      * Input Fields
      * ----------------------------------------------------------------
     A            {field_name1} 10A  B  5  2TEXT('Field description')
     A                                      DSPATR(UL)
     A            {field_name2} 10A  B  6  2TEXT('Field description')
     A                                      DSPATR(UL)
      *
      * ----------------------------------------------------------------
      * Output Fields
      * ----------------------------------------------------------------
     A            {output_field} 50A  O  8  2TEXT('Output description')
      *
      * ----------------------------------------------------------------
      * Function Key Line
      * ----------------------------------------------------------------
     A                                 23  2'F3=Exit   F12=Cancel'
     A                                      COLOR(BLU)
      *
      * ----------------------------------------------------------------
      * Error Message Subfile
      * ----------------------------------------------------------------
     A            MSGSFL        10A  O 24  2MSGID
      *
      * ----------------------------------------------------------------
      * Record Format: Subfile Control
      * ----------------------------------------------------------------
     A          R {sfl_ctl}                 SFLCTL({sfl_dta})
     A                                      CF03(03 'Exit')
     A                                      CF05(05 'Refresh')
     A                                      CF12(12 'Cancel')
     A                                      OVERLAY
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0015)
      *
      * ----------------------------------------------------------------
      * Subfile Control Indicators
      * ----------------------------------------------------------------
     A  31                                  SFLDSP
     A  32                                  SFLDSPCTL
     A  33                                  SFLCLR
     A  34                                  SFLEND(*MORE)
      *
      * ----------------------------------------------------------------
      * Screen Title
      * ----------------------------------------------------------------
     A                                  1  2'{subfile_title}'
     A                                      DSPATR(HI)
      *
      * ----------------------------------------------------------------
      * Column Headings
      * ----------------------------------------------------------------
     A                                  5  2'Opt'
     A                                  5  7'Column 1'
     A                                  5 20'Column 2'
     A                                  5 40'Column 3'
      *
      * ----------------------------------------------------------------
      * Function Key Line
      * ----------------------------------------------------------------
     A                                 23  2'F3=Exit   F5=Refresh   +
     A                                      F12=Cancel'
     A                                      COLOR(BLU)
      *
      * ----------------------------------------------------------------
      * Record Format: Subfile Data
      * ----------------------------------------------------------------
     A          R {sfl_dta}                 SFL
      *
      * ----------------------------------------------------------------
      * Subfile Fields
      * ----------------------------------------------------------------
     A            {opt_field}    1A  B  6  2TEXT('Option')
     A                                      DSPATR(UL)
     A            {sfl_field1}  10A  O  6  7TEXT('Field 1')
     A            {sfl_field2}  15A  O  6 20TEXT('Field 2')
     A            {sfl_field3}  20A  O  6 40TEXT('Field 3')
      *
      * ----------------------------------------------------------------
      * Hidden Key Field
      * ----------------------------------------------------------------
     A            {key_field}   10A  H      TEXT('Record key')
      *
      * ----------------------------------------------------------------
      * Record Format: Window/Popup
      * ----------------------------------------------------------------
     A          R {window_format}           WINDOW(10 40 10 30)
     A                                      CF12(12 'Cancel')
      *
      * ----------------------------------------------------------------
      * Window Content
      * ----------------------------------------------------------------
     A                                  2  2'{window_title}'
     A                                      DSPATR(HI)
     A            {window_field} 20A  B  4  2TEXT('Window field')
     A                                      DSPATR(UL)
      *
      * ----------------------------------------------------------------
      * Window Function Keys
      * ----------------------------------------------------------------
     A                                  9  2'F12=Cancel'
     A                                      COLOR(BLU)
      *
      * ----------------------------------------------------------------
      * End of Display File
      * ----------------------------------------------------------------
