      * ----------------------------------------------------------------
      * Project: {project_name}
      * Member : {member_name}
      * Desc   : {description}
      * Author : {author_name}
      * Date   : {creation_date}
      * ----------------------------------------------------------------
      *
      * ----------------------------------------------------------------
      * Printer File Definition
      * ----------------------------------------------------------------
     A                                      SPACEB(1)
     A                                      INDARA
      *
      * ----------------------------------------------------------------
      * Record Format: Page Header
      * ----------------------------------------------------------------
     A          R {header_format}           SKIPB(1)
     A                                      SPACEA(2)
      *
      * ----------------------------------------------------------------
      * Report Title
      * ----------------------------------------------------------------
     A                                  1  1'{report_title}'
     A                                  1 60'Page:'
     A                                  1 66PAGNBR
     A                                      EDTCDE(Z)
      *
      * ----------------------------------------------------------------
      * Report Date and Time
      * ----------------------------------------------------------------
     A                                  2  1'Date:'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  2 20'Time:'
     A                                  2 26TIME
      *
      * ----------------------------------------------------------------
      * Column Headers
      * ----------------------------------------------------------------
     A                                  4  1'Column 1'
     A                                      UNDERLINE
     A                                  4 15'Column 2'
     A                                      UNDERLINE
     A                                  4 30'Column 3'
     A                                      UNDERLINE
     A                                  4 50'Column 4'
     A                                      UNDERLINE
      *
      * ----------------------------------------------------------------
      * Record Format: Detail Line
      * ----------------------------------------------------------------
     A          R {detail_format}           SPACEA(1)
      *
      * ----------------------------------------------------------------
      * Detail Fields
      * ----------------------------------------------------------------
     A            {field1}      10A      1TEXT('Field 1')
     A            {field2}      10A     15TEXT('Field 2')
     A            {field3}      15A     30TEXT('Field 3')
     A            {field4}      15A     50TEXT('Field 4')
      *
      * ----------------------------------------------------------------
      * Record Format: Subtotal Line
      * ----------------------------------------------------------------
     A          R {subtotal_format}         SPACEB(1)
     A                                      SPACEA(1)
      *
      * ----------------------------------------------------------------
      * Subtotal Fields
      * ----------------------------------------------------------------
     A                                  +1 30'Subtotal:'
     A            {subtotal}    15Y 2   +1TEXT('Subtotal amount')
     A                                      EDTCDE(J)
      *
      * ----------------------------------------------------------------
      * Record Format: Total Line
      * ----------------------------------------------------------------
     A          R {total_format}            SPACEB(2)
     A                                      SPACEA(1)
      *
      * ----------------------------------------------------------------
      * Total Fields
      * ----------------------------------------------------------------
     A                                  +1 30'Grand Total:'
     A            {total}       15Y 2   +1TEXT('Grand total amount')
     A                                      EDTCDE(J)
      *
      * ----------------------------------------------------------------
      * Record Format: Footer
      * ----------------------------------------------------------------
     A          R {footer_format}           SPACEB(1)
      *
      * ----------------------------------------------------------------
      * Footer Text
      * ----------------------------------------------------------------
     A                                  +1  1'End of Report'
      *
      * ----------------------------------------------------------------
      * End of Printer File
      * ----------------------------------------------------------------
